# **MySQL Movie ETL Preparation**

- Yvon Bilodeau
- May 2022

## **Import Libraries**

In [1]:
# Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine

## **Normalize genres**

### **title_basics dataframe**

In [2]:
# Load the dataframe from the csv file
title_basics_df = pd.read_csv('Data/title_basics.csv.gz')

In [3]:
# Display the first (5) rows
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [4]:
# Convert strings into lists of strings in a new 'genres_split' column
title_basics_df['genres_split'] = title_basics_df['genres'].str.split(',')

In [5]:
# Display the first (2) rows
title_basics_df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]

In [6]:
# Create a new dataframe with a row
# for each genre a movie belongs to by using .explode
exploded_genres_df = title_basics_df.explode('genres_split')

In [7]:
# Display the first (2) rows
exploded_genres_df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy

In [8]:
# Create a list of unique genres from the genres_split column
unique_genres = sorted(exploded_genres_df['genres_split'].unique())

In [9]:
# Display the list of unique genres
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

### **title_genres dataframe**

In [10]:
# Save just tconst and genres_split as a new df
title_genres_df = exploded_genres_df[['tconst', 'genres_split']].copy()

In [11]:
# Display the first (5) rows
title_genres_df.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [12]:
# Make a dictionary
# with list of unique genres as the key and the new integer id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))

In [13]:
# Display the genre_id_map dictionary
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [14]:
# Create a genre_id column using the genre_map dictionary with .map
title_genres_df['genre_id'] = title_genres_df['genres_split'].map(genre_id_map)
# Drop the "genres_split" column
title_genres_df = title_genres_df.drop(columns='genres_split')

In [15]:
# Display the first (5) rows
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

### **genres dataframe**

In [16]:
# Create a dataframe from the genre_map dictionary with .map
genres_df = pd.DataFrame({'genre_name': genre_id_map.keys(),
                           'genre_id': genre_id_map.values()})

In [17]:
# Display the first (5) rows
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## **Create SQL Movies Database**

### **Passwords**

In [18]:
# Obtain the MySQL login username and password
with open('C:/Users/DELL/.secret/mysql_keys.json') as f:
    login = json.load(f)
# Display the MySQL login keys
login.keys()

dict_keys(['username', 'password'])

### **Connection**

In [19]:
# Create a connection string using credentials following this format:
# connection = "dialect+driver://username:password@host:port/database"
database_name = "Movies"
connection_str = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{database_name}"

### **Create the Engine**

In [20]:
# Create an instance of the sqlalchemy create_engine class
engine = create_engine(connection_str)

### **Create a New Database**

In [21]:
# Create the Movies database, if it does not already exist
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

## **Create SQL Tables**

### **title_basics SQL Table**

In [22]:
# Display the first (5) rows
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [23]:
# Display the names, non-null values, and datatypes for the columns
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79194 entries, 0 to 79193
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79194 non-null  object
 1   titleType       79194 non-null  object
 2   primaryTitle    79194 non-null  object
 3   originalTitle   79194 non-null  object
 4   isAdult         79194 non-null  int64
 5   startYear       79194 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  79194 non-null  int64
 8   genres          79194 non-null  object
 9   genres_split    79194 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.0+ MB

In [24]:
# Drop columns from the dataframe
title_basics_df = title_basics_df.drop(columns = ['titleType', 'originalTitle',
                                                  'isAdult', 'endYear', 'genres', 'genres_split'])

In [25]:
# Display the names, non-null values, and datatypes for the columns
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79194 entries, 0 to 79193
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79194 non-null  object
 1   primaryTitle    79194 non-null  object
 2   startYear       79194 non-null  int64
 3   runtimeMinutes  79194 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.4+ MB

In [26]:
# Calculate max string lengths for object columns
key_len = title_basics_df['tconst'].fillna('').map(len).max()
title_len = title_basics_df['primaryTitle'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns ('tconst' and 'primaryTitle') 
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1), 
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runtimeMinutes': Integer()}

In [27]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_basics_df.to_sql('title_basics',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [28]:
# Use the sqlalchemy engine to update the table, and 
# set the desired column as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [29]:
# Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM title_basics LIMIT 5
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0093119,Grizzly II: Revenge,2020,74

### **title_ratings SQL Table**

In [30]:
# Load the dataframe from the csv file
title_ratings_df = pd.read_csv('Data/title_ratings.csv.gz')

In [31]:
# Display the first (5) rows
title_ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

In [32]:
# Display the names, non-null values, and datatypes for the columns
title_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1238280 entries, 0 to 1238279
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1238280 non-null  object
 1   averageRating  1238280 non-null  float64
 2   numVotes       1238280 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.3+ MB

In [33]:
# Calculate max string lengths for object columns
key_len = title_ratings_df['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [34]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_ratings_df.to_sql('title_ratings',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [35]:
# Use the sqlalchemy engine to update the table, and 
# set tconst as the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [36]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_ratings LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

### **title_genres SQL Table**

In [37]:
# Display the first (5) rows
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [38]:
# Display the names, non-null values, and datatypes for the columns
title_genres_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148009 entries, 0 to 79193
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    148009 non-null  object
 1   genre_id  148009 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.4+ MB

In [39]:
# Calculate max string lengths for object columns
tconst_len = title_genres_df['tconst'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(tconst_len+1), 
    'genre_id':Integer()}

In [40]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
title_genres_df.to_sql('title_genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [41]:
# Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_genres LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### **genres SQL Table**

In [42]:
# Display the first (5) rows
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [43]:
# Display the names, non-null values, and datatypes for the columns
genres_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [44]:
# Calculate max string lengths for object columns
genre_name_len = genres_df['genre_name'].fillna('').map(len).max()

# Use 1 + the max_str_len for object columns 
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_id": Integer(), 
    'genre_name': String(genre_name_len+1)}

In [45]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
genres_df.to_sql('genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [46]:
# Use the sqlalchemy engine to update the table and set genre_id as the primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [47]:
# Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM genres LIMIT 5
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### **tmdb_data SQL Table**

In [48]:
# Load the dataframe from the csv file
tmdb_data_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [49]:
# Display the first (5) rows
tmdb_data_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1859.0,PG

In [50]:
# Display the names, non-null values, and datatypes for the columns
tmdb_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2474 entries, 0 to 2473
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2474 non-null   object
 1   adult                  2472 non-null   float64
 2   backdrop_path          1239 non-null   object
 3   belongs_to_collection  192 non-null    object
 4   budget                 2472 non-null   float64
 5   genres                 2472 non-null   object
 6   homepage               171 non-null    object
 7   id                     2472 non-null   float64
 8   original_language      2472 non-null   object
 9   original_title         2472 non-null   object
 10  overview               2419 non-null   object
 11  popularity             2472 non-null   float64
 12  poster_path            2157 non-null   object
 13  production_companies   2472 non-null   object
 14  production_countries   2472 non-null   object
 15  release_date           2450 non-null   object
 16  revenue                2472 non-null   float64
 17  runtime                2426 non-null   float64
 18  spoken_languages       2472 non-null   object
 19  status                 2472 non-null   object
 20  tagline                1019 non-null   object
 21  title                  2472 non-null   object
 22  video                  2472 non-null   float64
 23  vote_average           2472 non-null   float64
 24  vote_count             2472 non-null   float64
 25  certification          785 non-null    object
dtypes: float64(9), object(17)
memory usage: 502.7+ KB

In [51]:
# Drop 
tmdb_data_df = tmdb_data_df.loc[:,["imdb_id","revenue",'budget','certification']]

In [52]:
# tmdb_data_df.drop(tmdb_data_df.iloc[0,:], inplace=True, axis=0)
tmdb_data_df.drop(0, inplace=True, axis=0)

In [53]:
# Display the first (5) rows
tmdb_data_df.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [54]:
# Display the names, non-null values, and datatypes for the columns
tmdb_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2473 entries, 1 to 2473
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2473 non-null   object
 1   revenue        2472 non-null   float64
 2   budget         2472 non-null   float64
 3   certification  785 non-null    object
dtypes: float64(2), object(2)
memory usage: 96.6+ KB

In [55]:
# Calculate max string lengths for object columns
imdb_id_len = tmdb_data_df['imdb_id'].fillna('').map(len).max()
certification_len = tmdb_data_df['certification'].fillna('').map(len).max()


# Use 1 + the max_str_len for object columns
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'imdb_id': String(imdb_id_len+1), 
    'budget':Float(),
    'revenue':Float(),
    'certification': String(certification_len+1)}

In [56]:
# Save the dataframe to an sql table
# with appropriate datatypes and set index=False
tmdb_data_df.to_sql('tmdb_data',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [57]:
# Use the sqlalchemy engine to update the table and set imdb_id as the primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [58]:
# Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM tmdb_data LIMIT 5
;"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0113026         0.0  10000000.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

## **Show SQL Tables**

In [59]:
# Display the SQL table names using an SQL query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data